zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpspi_reg.h
     * |[16]    |TXEMPTY   |Transmit FIFO Buffer Empty Indicator (Read Only)
     * |        |          |0 = Transmit FIFO buffer is not empty.
     * |        |          |1 = Transmit FIFO buffer is empty.
     * |[17]    |TXFULL    |Transmit FIFO Buffer Full Indicator (Read Only)
     * |        |          |0 = Transmit FIFO buffer is not full.
     * |        |          |1 = Transmit FIFO buffer is full.
     * |[18]    |TXTHIF    |Transmit FIFO Threshold Interrupt Flag (Read Only)
     * |        |          |0 = The valid data count within the transmit FIFO buffer is larger than the setting value of TXTH.
     * |        |          |1 = The valid data count within the transmit FIFO buffer is less than or equal to the setting value of TXTH.
     * |[19]    |TXUFIF    |TX Underflow Interrupt Flag
     * |        |          |When the TX underflow event occurs, this bit will be set to 1, the state of data output pin depends on the setting of TXUFPOL.
     * |        |          |0 = No effect.
     * |        |          |1 = No data in Transmit FIFO and TX shift register when the slave selection signal is active.
     * |        |          |Note 1: This bit will be cleared by writing 1 to it.
     * |        |          |Note 2: If reset slaveu2019s transmission circuit when slave selection signal is active, this flag will be set to 1 after 2 peripheral clock cycles + 3 system clock cycles since the reset operation is done.
     * |[23]    |TXRXRST   |TX or RX Reset Status (Read Only)
     * |        |          |0 = The reset function of TXRST or RXRST is done.
     * |        |          |1 = Doing the reset function of TXRST or RXRST.
     * |        |          |Note: Both the reset operations of TXRST and RXRST need 3 system clock cycles + 2 peripheral clock cycles
     * |        |          |User can check the status of this bit to monitor the reset function is doing or done.
     * |[27:24] |RXCNT     |Receive FIFO Data Count (Read Only)
     * |        |          |This bit field indicates the valid data count of receive FIFO buffer.
     * |[31:28] |TXCNT     |Transmit FIFO Data Count (Read Only)
     * |        |          |This bit field indicates the valid data count of transmit FIFO buffer.
     * @var LPSPI_T::STATUS2
     * Offset: 0x18  SPI Status2 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[29:24] |SLVBENUM  |Effective Bit Number of Uncompleted RX data
     * |        |          |This status register indicates that effective bit number of uncompleted RX data when SLVBERX (LPSPI_FIFOCTL[10]) is enabled and RX bit count error event happen in SPI Slave mode.
     * |        |          |This status register will be fixed to 0x0 when SLVBERX (LPSPI_FIFOCTL[10]) is disabled.
     * |        |          |Note: This register will be cleared to 0x0 when user writes 0x1 to SLVBEIF (LPSPI_STATUS[6]).
     * |        |          |Note: This bit is for Slave Mode only.
     * @var LPSPI_T::TX
     * Offset: 0x20  SPI Data Transmit Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |TX        |Data Transmit Register
     * |        |          |The data transmit registers pass through the transmitted data into the 4-level transmit FIFO buffers
     * |        |          |The number of valid bits depends on the setting of DWIDTH (LPSPI_CTL[12:8]) in SPI mode.
     * |        |          |In SPI mode, if DWIDTH is set to 0x08, the bits TX[7:0] will be transmitted
     * |        |          |If DWIDTH is set to 0x00, the SPI controller will perform a 32-bit transfer.
     * |        |          |Note: In Master mode, SPI controller will start to transfer the SPI bus clock after 1 APB clock and 6 peripheral clock cycles after user writes to this register.
     * @var LPSPI_T::RX
     * Offset: 0x30  SPI Data Receive Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |RX        |Data Receive Register (Read Only)
     * |        |          |There are 4-level FIFO buffers in this controller
     * |        |          |The data receive register holds the data received from SPI data input pin
     * |        |          |If the RXEMPTY (LPSPI_STATUS[8]) is not set to 1, the receive FIFO buffers can be accessed through software by reading this register.
     * @var LPSPI_T::AUTOCTL
     * Offset: 0x50  LPSPI Automatic Operation Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |TRIGSEL   |Automatic Operation Trigger Source Select
     * |        |          |0000 = Low Power Auto-operation Trigger Source from LPTMR0.
     * |        |          |0001 = Low Power Auto-operation Trigger Source from LPTMR1.
     * |        |          |0010 = Low Power Auto-operation Trigger Source from TTMR0.
     * |        |          |0011 = Low Power Auto-operation Trigger Source from TTMR1.
     * |        |          |0100 = Low Power Auto-operation Trigger Source from LPGPIO0.
     * |        |          |0101 = Low Power Auto-operation Trigger Source from LPGPIO1.
     * |        |          |0110 = Low Power Auto-operation Trigger Source from LPGPIO2.
     * |        |          |0111 = Low Power Auto-operation Trigger Source from LPGPIO3.
     * |        |          |1000~1111 = Reserved.
     * |[4]     |TRIGEN    |Automatic Operation Trigger Enable Bit
     * |        |          |In Auomatic Operation Master mode, the automatic operation of LPSPI will be triggered by a event sent from the trigger source selected by TRIGSEL[3:0] after this bit is set to 1.
     * |        |          |0 = LPSPI Automatic Operation Trigger disabled.
     * |        |          |1 = LPSPI Automatic Operation Trigger enabled.
     * |[5]     |CNTIEN    |TCNT Count Match Interrupt Enable
     * |        |          |0 = TCNT count match interrupt disabled.
     * |        |          |1 = TCNT count match interrupt enabled.
     * |[6]     |FULLRXEN  |Full RX Data Acception Enable Bit
     * |        |          |In Auomatic Operation Master mode and LPSPI operates in full-duplex mode, the RX data will be saved from RX buffer by LPPDMA when TXPDMAEN is 1 after this bit is set to 1.
     * |[7]     |SSWKEN    |Slave Select Wake Up Enable Bit
     * |        |          |In Auomatic Operation Slave mode, the CPU will be woken up by SS falling or rising edge in NPDx mode after this bit is set to 1.
     * |        |          |0 = LPSPI SS wake-up function disabled.
     * |        |          |1 = LPSPI SS wake-up function enabled.
     * |[23:16] |TCNT      |Auomatic Operation RX Transfer Count
     * |        |          |In Auomatic Operation Master mode, TCNT represents the required number of RX data received from external SPI slave device while TXPDMAEN is 0 and RXPDMAEN is 1
     * |        |          |The maximum transfer count is 255.
     * @var LPSPI_T::AUTOSTS
     * Offset: 0x54  LPSPI Automatic Operation Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CNTIF     |TCNT Count Match Interrupt Flag
     * |        |          |When the received data count matchs the setting value of TCNT, this bit will be set to 1.
     * |        |          |0 = The received data count is less than the setting value of TCNT.
     * |        |          |1 = The received data count is equal than the setting value of TCNT.
     * |[1]     |SSWKF     |Slave Select Wake Up Flag
     * |        |          |In Slave mode, when chip is woken up from NPDx mode by LPSPI, this bit is set to 1
     * |        |          |Software can write 1 to clear this bit.
     * |[2]     |AOBUSY    |Automatic Operation Busy Flag
     * |        |          |When there were one or more requests from trigger sources during auto operation, this bit will be set to 1
     * |        |          |Software can write 1 to clear this bit.
     */
    __IO uint32_t CTL;                   /*!< [0x0000] SPI Control Register                                             */
    __IO uint32_t CLKDIV;                /*!< [0x0004] SPI Clock Divider Register                                       */
    __IO uint32_t SSCTL;                 /*!< [0x0008] SPI Slave Select Control Register                                */
    __IO uint32_t PDMACTL;               /*!< [0x000c] SPI PDMA Control Register                                        */
    __IO uint32_t FIFOCTL;               /*!< [0x0010] SPI FIFO Control Register                                        */
    __IO uint32_t STATUS;                /*!< [0x0014] SPI Status Register                                              */
    __I  uint32_t STATUS2;               /*!< [0x0018] SPI Status2 Register                                             */
    __I  uint32_t RESERVE0[1];
    __O  uint32_t TX;                    /*!< [0x0020] SPI Data Transmit Register                                       */
    __I  uint32_t RESERVE1[3];
    __I  uint32_t RX;                    /*!< [0x0030] SPI Data Receive Register                                        */
    __I  uint32_t RESERVE2[5];
    __IO uint32_t INTERNAL;
    __I  uint32_t RESERVE3[1];
    __IO uint32_t AUTOCTL;               /*!< [0x0050] LPSPI Automatic Operation Control Register                       */
    __IO uint32_t AUTOSTS;               /*!< [0x0054] LPSPI Automatic Operation Status Register                        */

