zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpspi_reg.h
} LPSPI_T;

/**
    @addtogroup LPSPI_CONST LPSPI Bit Field Definition
    Constant Definitions for LPSPI Controller
@{ */

#define LPSPI_CTL_SPIEN_Pos              (0)                                               /*!< LPSPI_T::CTL: SPIEN Position           */
#define LPSPI_CTL_SPIEN_Msk              (0x1ul << LPSPI_CTL_SPIEN_Pos)                    /*!< LPSPI_T::CTL: SPIEN Mask               */

#define LPSPI_CTL_RXNEG_Pos              (1)                                               /*!< LPSPI_T::CTL: RXNEG Position           */
#define LPSPI_CTL_RXNEG_Msk              (0x1ul << LPSPI_CTL_RXNEG_Pos)                    /*!< LPSPI_T::CTL: RXNEG Mask               */

#define LPSPI_CTL_TXNEG_Pos              (2)                                               /*!< LPSPI_T::CTL: TXNEG Position           */
#define LPSPI_CTL_TXNEG_Msk              (0x1ul << LPSPI_CTL_TXNEG_Pos)                    /*!< LPSPI_T::CTL: TXNEG Mask               */

#define LPSPI_CTL_CLKPOL_Pos             (3)                                               /*!< LPSPI_T::CTL: CLKPOL Position          */
#define LPSPI_CTL_CLKPOL_Msk             (0x1ul << LPSPI_CTL_CLKPOL_Pos)                   /*!< LPSPI_T::CTL: CLKPOL Mask              */

#define LPSPI_CTL_SUSPITV_Pos            (4)                                               /*!< LPSPI_T::CTL: SUSPITV Position         */
#define LPSPI_CTL_SUSPITV_Msk            (0xful << LPSPI_CTL_SUSPITV_Pos)                  /*!< LPSPI_T::CTL: SUSPITV Mask             */

#define LPSPI_CTL_DWIDTH_Pos             (8)                                               /*!< LPSPI_T::CTL: DWIDTH Position          */
#define LPSPI_CTL_DWIDTH_Msk             (0x1ful << LPSPI_CTL_DWIDTH_Pos)                  /*!< LPSPI_T::CTL: DWIDTH Mask              */

#define LPSPI_CTL_LSB_Pos                (13)                                              /*!< LPSPI_T::CTL: LSB Position             */
#define LPSPI_CTL_LSB_Msk                (0x1ul << LPSPI_CTL_LSB_Pos)                      /*!< LPSPI_T::CTL: LSB Mask                 */

#define LPSPI_CTL_HALFDPX_Pos            (14)                                              /*!< LPSPI_T::CTL: HALFDPX Position         */
#define LPSPI_CTL_HALFDPX_Msk            (0x1ul << LPSPI_CTL_HALFDPX_Pos)                  /*!< LPSPI_T::CTL: HALFDPX Mask             */

#define LPSPI_CTL_RXONLY_Pos             (15)                                              /*!< LPSPI_T::CTL: RXONLY Position          */
#define LPSPI_CTL_RXONLY_Msk             (0x1ul << LPSPI_CTL_RXONLY_Pos)                   /*!< LPSPI_T::CTL: RXONLY Mask              */

#define LPSPI_CTL_UNITIEN_Pos            (17)                                              /*!< LPSPI_T::CTL: UNITIEN Position         */
#define LPSPI_CTL_UNITIEN_Msk            (0x1ul << LPSPI_CTL_UNITIEN_Pos)                  /*!< LPSPI_T::CTL: UNITIEN Mask             */

#define LPSPI_CTL_SLAVE_Pos              (18)                                              /*!< LPSPI_T::CTL: SLAVE Position           */
#define LPSPI_CTL_SLAVE_Msk              (0x1ul << LPSPI_CTL_SLAVE_Pos)                    /*!< LPSPI_T::CTL: SLAVE Mask               */

#define LPSPI_CTL_REORDER_Pos            (19)                                              /*!< LPSPI_T::CTL: REORDER Position         */
#define LPSPI_CTL_REORDER_Msk            (0x1ul << LPSPI_CTL_REORDER_Pos)                  /*!< LPSPI_T::CTL: REORDER Mask             */

#define LPSPI_CTL_DATDIR_Pos             (20)                                              /*!< LPSPI_T::CTL: DATDIR Position          */
#define LPSPI_CTL_DATDIR_Msk             (0x1ul << LPSPI_CTL_DATDIR_Pos)                   /*!< LPSPI_T::CTL: DATDIR Mask              */

#define LPSPI_CLKDIV_DIVIDER_Pos         (0)                                               /*!< LPSPI_T::CLKDIV: DIVIDER Position      */
#define LPSPI_CLKDIV_DIVIDER_Msk         (0x1fful << LPSPI_CLKDIV_DIVIDER_Pos)             /*!< LPSPI_T::CLKDIV: DIVIDER Mask          */

#define LPSPI_SSCTL_SS_Pos               (0)                                               /*!< LPSPI_T::SSCTL: SS Position            */
#define LPSPI_SSCTL_SS_Msk               (0x1ul << LPSPI_SSCTL_SS_Pos)                     /*!< LPSPI_T::SSCTL: SS Mask                */

#define LPSPI_SSCTL_SSACTPOL_Pos         (2)                                               /*!< LPSPI_T::SSCTL: SSACTPOL Position      */
#define LPSPI_SSCTL_SSACTPOL_Msk         (0x1ul << LPSPI_SSCTL_SSACTPOL_Pos)               /*!< LPSPI_T::SSCTL: SSACTPOL Mask          */

#define LPSPI_SSCTL_AUTOSS_Pos           (3)                                               /*!< LPSPI_T::SSCTL: AUTOSS Position        */
#define LPSPI_SSCTL_AUTOSS_Msk           (0x1ul << LPSPI_SSCTL_AUTOSS_Pos)                 /*!< LPSPI_T::SSCTL: AUTOSS Mask            */

#define LPSPI_SSCTL_SLV3WIRE_Pos         (4)                                               /*!< LPSPI_T::SSCTL: SLV3WIRE Position      */
#define LPSPI_SSCTL_SLV3WIRE_Msk         (0x1ul << LPSPI_SSCTL_SLV3WIRE_Pos)               /*!< LPSPI_T::SSCTL: SLV3WIRE Mask          */

#define LPSPI_SSCTL_SLVBEIEN_Pos         (8)                                               /*!< LPSPI_T::SSCTL: SLVBEIEN Position      */
#define LPSPI_SSCTL_SLVBEIEN_Msk         (0x1ul << LPSPI_SSCTL_SLVBEIEN_Pos)               /*!< LPSPI_T::SSCTL: SLVBEIEN Mask          */

#define LPSPI_SSCTL_SLVURIEN_Pos         (9)                                               /*!< LPSPI_T::SSCTL: SLVURIEN Position      */
#define LPSPI_SSCTL_SLVURIEN_Msk         (0x1ul << LPSPI_SSCTL_SLVURIEN_Pos)               /*!< LPSPI_T::SSCTL: SLVURIEN Mask          */

#define LPSPI_SSCTL_SSACTIEN_Pos         (12)                                              /*!< LPSPI_T::SSCTL: SSACTIEN Position      */
#define LPSPI_SSCTL_SSACTIEN_Msk         (0x1ul << LPSPI_SSCTL_SSACTIEN_Pos)               /*!< LPSPI_T::SSCTL: SSACTIEN Mask          */

#define LPSPI_SSCTL_SSINAIEN_Pos         (13)                                              /*!< LPSPI_T::SSCTL: SSINAIEN Position      */
#define LPSPI_SSCTL_SSINAIEN_Msk         (0x1ul << LPSPI_SSCTL_SSINAIEN_Pos)               /*!< LPSPI_T::SSCTL: SSINAIEN Mask          */

#define LPSPI_PDMACTL_TXPDMAEN_Pos       (0)                                               /*!< LPSPI_T::PDMACTL: TXPDMAEN Position    */
#define LPSPI_PDMACTL_TXPDMAEN_Msk       (0x1ul << LPSPI_PDMACTL_TXPDMAEN_Pos)             /*!< LPSPI_T::PDMACTL: TXPDMAEN Mask        */

#define LPSPI_PDMACTL_RXPDMAEN_Pos       (1)                                               /*!< LPSPI_T::PDMACTL: RXPDMAEN Position    */
#define LPSPI_PDMACTL_RXPDMAEN_Msk       (0x1ul << LPSPI_PDMACTL_RXPDMAEN_Pos)             /*!< LPSPI_T::PDMACTL: RXPDMAEN Mask        */

#define LPSPI_PDMACTL_PDMARST_Pos        (2)                                               /*!< LPSPI_T::PDMACTL: PDMARST Position     */
#define LPSPI_PDMACTL_PDMARST_Msk        (0x1ul << LPSPI_PDMACTL_PDMARST_Pos)              /*!< LPSPI_T::PDMACTL: PDMARST Mask         */

#define LPSPI_FIFOCTL_RXRST_Pos          (0)                                               /*!< LPSPI_T::FIFOCTL: RXRST Position       */
#define LPSPI_FIFOCTL_RXRST_Msk          (0x1ul << LPSPI_FIFOCTL_RXRST_Pos)                /*!< LPSPI_T::FIFOCTL: RXRST Mask           */

#define LPSPI_FIFOCTL_TXRST_Pos          (1)                                               /*!< LPSPI_T::FIFOCTL: TXRST Position       */
#define LPSPI_FIFOCTL_TXRST_Msk          (0x1ul << LPSPI_FIFOCTL_TXRST_Pos)                /*!< LPSPI_T::FIFOCTL: TXRST Mask           */

#define LPSPI_FIFOCTL_RXTHIEN_Pos        (2)                                               /*!< LPSPI_T::FIFOCTL: RXTHIEN Position     */
#define LPSPI_FIFOCTL_RXTHIEN_Msk        (0x1ul << LPSPI_FIFOCTL_RXTHIEN_Pos)              /*!< LPSPI_T::FIFOCTL: RXTHIEN Mask         */

