zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpspi_reg.h
#define LPSPI_FIFOCTL_TXTHIEN_Pos        (3)                                               /*!< LPSPI_T::FIFOCTL: TXTHIEN Position     */
#define LPSPI_FIFOCTL_TXTHIEN_Msk        (0x1ul << LPSPI_FIFOCTL_TXTHIEN_Pos)              /*!< LPSPI_T::FIFOCTL: TXTHIEN Mask         */

#define LPSPI_FIFOCTL_RXTOIEN_Pos        (4)                                               /*!< LPSPI_T::FIFOCTL: RXTOIEN Position     */
#define LPSPI_FIFOCTL_RXTOIEN_Msk        (0x1ul << LPSPI_FIFOCTL_RXTOIEN_Pos)              /*!< LPSPI_T::FIFOCTL: RXTOIEN Mask         */

#define LPSPI_FIFOCTL_RXOVIEN_Pos        (5)                                               /*!< LPSPI_T::FIFOCTL: RXOVIEN Position     */
#define LPSPI_FIFOCTL_RXOVIEN_Msk        (0x1ul << LPSPI_FIFOCTL_RXOVIEN_Pos)              /*!< LPSPI_T::FIFOCTL: RXOVIEN Mask         */

#define LPSPI_FIFOCTL_TXUFPOL_Pos        (6)                                               /*!< LPSPI_T::FIFOCTL: TXUFPOL Position     */
#define LPSPI_FIFOCTL_TXUFPOL_Msk        (0x1ul << LPSPI_FIFOCTL_TXUFPOL_Pos)              /*!< LPSPI_T::FIFOCTL: TXUFPOL Mask         */

#define LPSPI_FIFOCTL_TXUFIEN_Pos        (7)                                               /*!< LPSPI_T::FIFOCTL: TXUFIEN Position     */
#define LPSPI_FIFOCTL_TXUFIEN_Msk        (0x1ul << LPSPI_FIFOCTL_TXUFIEN_Pos)              /*!< LPSPI_T::FIFOCTL: TXUFIEN Mask         */

#define LPSPI_FIFOCTL_RXFBCLR_Pos        (8)                                               /*!< LPSPI_T::FIFOCTL: RXFBCLR Position     */
#define LPSPI_FIFOCTL_RXFBCLR_Msk        (0x1ul << LPSPI_FIFOCTL_RXFBCLR_Pos)              /*!< LPSPI_T::FIFOCTL: RXFBCLR Mask         */

#define LPSPI_FIFOCTL_TXFBCLR_Pos        (9)                                               /*!< LPSPI_T::FIFOCTL: TXFBCLR Position     */
#define LPSPI_FIFOCTL_TXFBCLR_Msk        (0x1ul << LPSPI_FIFOCTL_TXFBCLR_Pos)              /*!< LPSPI_T::FIFOCTL: TXFBCLR Mask         */

#define LPSPI_FIFOCTL_SLVBERX_Pos        (10)                                              /*!< LPSPI_T::FIFOCTL: SLVBERX Position     */
#define LPSPI_FIFOCTL_SLVBERX_Msk        (0x1ul << LPSPI_FIFOCTL_SLVBERX_Pos)              /*!< LPSPI_T::FIFOCTL: SLVBERX Mask         */

#define LPSPI_FIFOCTL_RXTH_Pos           (24)                                              /*!< LPSPI_T::FIFOCTL: RXTH Position        */
#define LPSPI_FIFOCTL_RXTH_Msk           (0x7ul << LPSPI_FIFOCTL_RXTH_Pos)                 /*!< LPSPI_T::FIFOCTL: RXTH Mask            */

#define LPSPI_FIFOCTL_TXTH_Pos           (28)                                              /*!< LPSPI_T::FIFOCTL: TXTH Position        */
#define LPSPI_FIFOCTL_TXTH_Msk           (0x7ul << LPSPI_FIFOCTL_TXTH_Pos)                 /*!< LPSPI_T::FIFOCTL: TXTH Mask            */

#define LPSPI_STATUS_BUSY_Pos            (0)                                               /*!< LPSPI_T::STATUS: BUSY Position         */
#define LPSPI_STATUS_BUSY_Msk            (0x1ul << LPSPI_STATUS_BUSY_Pos)                  /*!< LPSPI_T::STATUS: BUSY Mask             */

#define LPSPI_STATUS_UNITIF_Pos          (1)                                               /*!< LPSPI_T::STATUS: UNITIF Position       */
#define LPSPI_STATUS_UNITIF_Msk          (0x1ul << LPSPI_STATUS_UNITIF_Pos)                /*!< LPSPI_T::STATUS: UNITIF Mask           */

#define LPSPI_STATUS_SSACTIF_Pos         (2)                                               /*!< LPSPI_T::STATUS: SSACTIF Position      */
#define LPSPI_STATUS_SSACTIF_Msk         (0x1ul << LPSPI_STATUS_SSACTIF_Pos)               /*!< LPSPI_T::STATUS: SSACTIF Mask          */

#define LPSPI_STATUS_SSINAIF_Pos         (3)                                               /*!< LPSPI_T::STATUS: SSINAIF Position      */
#define LPSPI_STATUS_SSINAIF_Msk         (0x1ul << LPSPI_STATUS_SSINAIF_Pos)               /*!< LPSPI_T::STATUS: SSINAIF Mask          */

#define LPSPI_STATUS_SSLINE_Pos          (4)                                               /*!< LPSPI_T::STATUS: SSLINE Position       */
#define LPSPI_STATUS_SSLINE_Msk          (0x1ul << LPSPI_STATUS_SSLINE_Pos)                /*!< LPSPI_T::STATUS: SSLINE Mask           */

#define LPSPI_STATUS_SLVBEIF_Pos         (6)                                               /*!< LPSPI_T::STATUS: SLVBEIF Position      */
#define LPSPI_STATUS_SLVBEIF_Msk         (0x1ul << LPSPI_STATUS_SLVBEIF_Pos)               /*!< LPSPI_T::STATUS: SLVBEIF Mask          */

#define LPSPI_STATUS_SLVURIF_Pos         (7)                                               /*!< LPSPI_T::STATUS: SLVURIF Position      */
#define LPSPI_STATUS_SLVURIF_Msk         (0x1ul << LPSPI_STATUS_SLVURIF_Pos)               /*!< LPSPI_T::STATUS: SLVURIF Mask          */

#define LPSPI_STATUS_RXEMPTY_Pos         (8)                                               /*!< LPSPI_T::STATUS: RXEMPTY Position      */
#define LPSPI_STATUS_RXEMPTY_Msk         (0x1ul << LPSPI_STATUS_RXEMPTY_Pos)               /*!< LPSPI_T::STATUS: RXEMPTY Mask          */

#define LPSPI_STATUS_RXFULL_Pos          (9)                                               /*!< LPSPI_T::STATUS: RXFULL Position       */
#define LPSPI_STATUS_RXFULL_Msk          (0x1ul << LPSPI_STATUS_RXFULL_Pos)                /*!< LPSPI_T::STATUS: RXFULL Mask           */

#define LPSPI_STATUS_RXTHIF_Pos          (10)                                              /*!< LPSPI_T::STATUS: RXTHIF Position       */
#define LPSPI_STATUS_RXTHIF_Msk          (0x1ul << LPSPI_STATUS_RXTHIF_Pos)                /*!< LPSPI_T::STATUS: RXTHIF Mask           */

#define LPSPI_STATUS_RXOVIF_Pos          (11)                                              /*!< LPSPI_T::STATUS: RXOVIF Position       */
#define LPSPI_STATUS_RXOVIF_Msk          (0x1ul << LPSPI_STATUS_RXOVIF_Pos)                /*!< LPSPI_T::STATUS: RXOVIF Mask           */

#define LPSPI_STATUS_RXTOIF_Pos          (12)                                              /*!< LPSPI_T::STATUS: RXTOIF Position       */
#define LPSPI_STATUS_RXTOIF_Msk          (0x1ul << LPSPI_STATUS_RXTOIF_Pos)                /*!< LPSPI_T::STATUS: RXTOIF Mask           */

#define LPSPI_STATUS_SPIENSTS_Pos        (15)                                              /*!< LPSPI_T::STATUS: SPIENSTS Position     */
#define LPSPI_STATUS_SPIENSTS_Msk        (0x1ul << LPSPI_STATUS_SPIENSTS_Pos)              /*!< LPSPI_T::STATUS: SPIENSTS Mask         */

#define LPSPI_STATUS_TXEMPTY_Pos         (16)                                              /*!< LPSPI_T::STATUS: TXEMPTY Position      */
#define LPSPI_STATUS_TXEMPTY_Msk         (0x1ul << LPSPI_STATUS_TXEMPTY_Pos)               /*!< LPSPI_T::STATUS: TXEMPTY Mask          */

#define LPSPI_STATUS_TXFULL_Pos          (17)                                              /*!< LPSPI_T::STATUS: TXFULL Position       */
#define LPSPI_STATUS_TXFULL_Msk          (0x1ul << LPSPI_STATUS_TXFULL_Pos)                /*!< LPSPI_T::STATUS: TXFULL Mask           */

#define LPSPI_STATUS_TXTHIF_Pos          (18)                                              /*!< LPSPI_T::STATUS: TXTHIF Position       */
#define LPSPI_STATUS_TXTHIF_Msk          (0x1ul << LPSPI_STATUS_TXTHIF_Pos)                /*!< LPSPI_T::STATUS: TXTHIF Mask           */

