zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpspi_reg.h
#define LPSPI_STATUS_TXUFIF_Pos          (19)                                              /*!< LPSPI_T::STATUS: TXUFIF Position       */
#define LPSPI_STATUS_TXUFIF_Msk          (0x1ul << LPSPI_STATUS_TXUFIF_Pos)                /*!< LPSPI_T::STATUS: TXUFIF Mask           */

#define LPSPI_STATUS_TXRXRST_Pos         (23)                                              /*!< LPSPI_T::STATUS: TXRXRST Position      */
#define LPSPI_STATUS_TXRXRST_Msk         (0x1ul << LPSPI_STATUS_TXRXRST_Pos)               /*!< LPSPI_T::STATUS: TXRXRST Mask          */

#define LPSPI_STATUS_RXCNT_Pos           (24)                                              /*!< LPSPI_T::STATUS: RXCNT Position        */
#define LPSPI_STATUS_RXCNT_Msk           (0xful << LPSPI_STATUS_RXCNT_Pos)                 /*!< LPSPI_T::STATUS: RXCNT Mask            */

#define LPSPI_STATUS_TXCNT_Pos           (28)                                              /*!< LPSPI_T::STATUS: TXCNT Position        */
#define LPSPI_STATUS_TXCNT_Msk           (0xful << LPSPI_STATUS_TXCNT_Pos)                 /*!< LPSPI_T::STATUS: TXCNT Mask            */

#define LPSPI_STATUS2_SLVBENUM_Pos       (24)                                              /*!< LPSPI_T::STATUS2: SLVBENUM Position    */
#define LPSPI_STATUS2_SLVBENUM_Msk       (0x3ful << LPSPI_STATUS2_SLVBENUM_Pos)            /*!< LPSPI_T::STATUS2: SLVBENUM Mask        */

#define LPSPI_TX_TX_Pos                  (0)                                               /*!< LPSPI_T::TX: TX Position               */
#define LPSPI_TX_TX_Msk                  (0xfffffffful << LPSPI_TX_TX_Pos)                 /*!< LPSPI_T::TX: TX Mask                   */

#define LPSPI_RX_RX_Pos                  (0)                                               /*!< LPSPI_T::RX: RX Position               */
#define LPSPI_RX_RX_Msk                  (0xfffffffful << LPSPI_RX_RX_Pos)                 /*!< LPSPI_T::RX: RX Mask                   */

#define LPSPI_AUTOCTL_TRIGSEL_Pos        (0)                                               /*!< LPSPI_T::AUTOCTL: TRIGSEL Position     */
#define LPSPI_AUTOCTL_TRIGSEL_Msk        (0xful << LPSPI_AUTOCTL_TRIGSEL_Pos)              /*!< LPSPI_T::AUTOCTL: TRIGSEL Mask         */

#define LPSPI_AUTOCTL_TRIGEN_Pos         (4)                                               /*!< LPSPI_T::AUTOCTL: TRIGEN Position      */
#define LPSPI_AUTOCTL_TRIGEN_Msk         (0x1ul << LPSPI_AUTOCTL_TRIGEN_Pos)               /*!< LPSPI_T::AUTOCTL: TRIGEN Mask          */

#define LPSPI_AUTOCTL_CNTIEN_Pos         (5)                                               /*!< LPSPI_T::AUTOCTL: CNTIEN Position      */
#define LPSPI_AUTOCTL_CNTIEN_Msk         (0x1ul << LPSPI_AUTOCTL_CNTIEN_Pos)               /*!< LPSPI_T::AUTOCTL: CNTIEN Mask          */

#define LPSPI_AUTOCTL_FULLRXEN_Pos       (6)                                               /*!< LPSPI_T::AUTOCTL: FULLRXEN Position    */
#define LPSPI_AUTOCTL_FULLRXEN_Msk       (0x1ul << LPSPI_AUTOCTL_FULLRXEN_Pos)             /*!< LPSPI_T::AUTOCTL: FULLRXEN Mask        */

#define LPSPI_AUTOCTL_SSWKEN_Pos         (7)                                               /*!< LPSPI_T::AUTOCTL: SSWKEN Position      */
#define LPSPI_AUTOCTL_SSWKEN_Msk         (0x1ul << LPSPI_AUTOCTL_SSWKEN_Pos)               /*!< LPSPI_T::AUTOCTL: SSWKEN Mask          */

#define LPSPI_AUTOCTL_AUTOEN_Pos         (8)                                               /*!< LPSPI_T::AUTOCTL: AUTOEN Position      */
#define LPSPI_AUTOCTL_AUTOEN_Msk         (0x1ul << LPSPI_AUTOCTL_AUTOEN_Pos)               /*!< LPSPI_T::AUTOCTL: AUTOEN Mask          */

#define LPSPI_AUTOCTL_SWTRG_Pos          (9)                                               /*!< LPSPI_T::AUTOCTL: SWTRG Position      */
#define LPSPI_AUTOCTL_SWTRG_Msk          (0x1ul << LPSPI_AUTOCTL_SWTRG_Pos)                /*!< LPSPI_T::AUTOCTL: SWTRG Mask          */

#define LPSPI_AUTOCTL_CNTWKEN_Pos        (10)                                              /*!< LPSPI_T::AUTOCTL: CNTWKEN Position      */
#define LPSPI_AUTOCTL_CNTWKEN_Msk        (0x1ul << LPSPI_AUTOCTL_CNTWKEN_Pos)              /*!< LPSPI_T::AUTOCTL: CNTWKEN Mask          */

#define LPSPI_AUTOCTL_TCNT_Pos           (16)                                              /*!< LPSPI_T::AUTOCTL: TCNT Position        */
#define LPSPI_AUTOCTL_TCNT_Msk           (0xfful << LPSPI_AUTOCTL_TCNT_Pos)                /*!< LPSPI_T::AUTOCTL: TCNT Mask            */

#define LPSPI_AUTOSTS_CNTIF_Pos          (0)                                               /*!< LPSPI_T::AUTOSTS: CNTIF Position       */
#define LPSPI_AUTOSTS_CNTIF_Msk          (0x1ul << LPSPI_AUTOSTS_CNTIF_Pos)                /*!< LPSPI_T::AUTOSTS: CNTIF Mask           */

#define LPSPI_AUTOSTS_SSWKF_Pos          (1)                                               /*!< LPSPI_T::AUTOSTS: SSWKF Position       */
#define LPSPI_AUTOSTS_SSWKF_Msk          (0x1ul << LPSPI_AUTOSTS_SSWKF_Pos)                /*!< LPSPI_T::AUTOSTS: SSWKF Mask           */

#define LPSPI_AUTOSTS_AOBUSY_Pos         (2)                                               /*!< LPSPI_T::AUTOSTS: AOBUSY Position      */
#define LPSPI_AUTOSTS_AOBUSY_Msk         (0x1ul << LPSPI_AUTOSTS_AOBUSY_Pos)               /*!< LPSPI_T::AUTOSTS: AOBUSY Mask          */

#define LPSPI_AUTOSTS_CNTWKF_Pos         (3)                                               /*!< LPSPI_T::AUTOSTS: CNTWKF Position       */
#define LPSPI_AUTOSTS_CNTWKF_Msk         (0x1ul << LPSPI_AUTOSTS_CNTWKF_Pos)                /*!< LPSPI_T::AUTOSTS: CNTWKF Mask           */

/** @} LPSPI_CONST */
/** @} end of LPSPI register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPSPI_REG_H__ */
